/**************************************************************************
	VLAN Assignment
***************************************************************************/

	Different Cisco Switches support all kinds of various numbers of VLANS

	Catalyst 2960 and 3560 support 4,096

	Normal VLAN range is 1 to 1005

	Entended VLAN range is 1006 to 4096

	4096 is the upper boundary for the number of VLANs available on Catalyst
		switches, because there are 12 bits in the VLAN ID field of the 
		IEEE 802.1Q header. 

Normal Range VLANS
	
	Used in small- and medium-sized business and enterprise networks.

    Identified by a VLAN ID between 1 and 1005.

    IDs 1002 through 1005 are reserved for Token Ring and FDDI VLANs.

    IDs 1 and 1002 to 1005 are automatically created and cannot be removed.

    Configurations are stored within a VLAN database file, called 
		vlan.dat. The vlan.dat file is located in the flash memory of the
		 switch.

    The VLAN Trunking Protocol (VTP), which helps manage VLAN configurations
		between switches, can only learn and store normal range VLANs.


Extended Range VLANs


    Enable service providers to extend their infrastructure to a greater 
		number of customers. Some global enterprises could be large enough 
		to need extended range VLAN IDs.

    Are identified by a VLAN ID between 1006 and 4094.

    Configurations are not written to the vlan.dat file.

    Support fewer VLAN features than normal range VLANs.

    Are, by default, saved in the running configuration file.

    VTP does not learn extended range VLANs.


Creating a VLAN

	When configuring normal range VLAN:

		Configuration details are stored in flash memory in file vlan.dat

			Flash memory is persistent and does not require the
				copy running-config startup-config command

			But since you do other things while configuring VLANS, you still
			should use the command

		Naming each VLAN is considered a best practice.

		[COMMAND]

			S1# configur terminal

			S1(config)# vlan [vlan-id]
				Creates the vlan with a valid id number

			S1(config-vlan)# name vlan-name
				speicify a name

			S1(config-vlan)# end


		To check configuration use [COMMAND] S1# show vlan brief

		In addition to entering a single VLAN ID, a series can be entered
			separated by commas

			[COMMAND]

				S1#(config)# vlan 100,102,105-107

		

Assigning Ports to VLANS

	Next step after creating a VLAN is assigning ports to that VLAN.

	An Access port can belong to only one VLAN at a time

		ONE EXCEPTION: port onnected to an IP phone,

		In this case there are two VLANS associated with one port, one voice
			and one for data

	Using the [COMMAND] switchport mode access// is optional but strongly
		recommended as a security best practice. This forces the interface
		into permanent access mode.

	Using the [COMMAND] switchport access vlan/// command forces the
		creation of the VLAN if it does not exist already.

	[COMMAND]

		S1# configure terminal

		S1(config)# interface [ interface_id ]
		ORRR
		S1(config)# interface range [interface module/ interface begin - end]
			Select the interfaces to add

		S1(config-if)# switchport mode access
			Set the mode to acceess (optional, but best practice)

		S1(config-if)# switchport access vlan [vlan_id]
			Assign the port to the VLAN

		S1(config-if)# end

Changing VLAN Port membership

	Many ways

	Either [COMMANDS] no switchport access vlan

	ORRR

	[COMMAND] switchport access vlan [vlan_id]

	Either remove its access and it will be thrown to the defualt, or
		you can just simply change it to the specified
	
	Note that the VLAN isn't removed by removing all the ports from it

Deleting VLANS

	[COMMAND] no vlan [vlan_id]


	CAUTION: before deleting, reassign member ports to a different VLAN
		as they cannot communicate until they are added to an active VLAN

	Alternatively you can delete the entive VLAN database by 

	[COMMAND] delete flash:vlan.dat
	ORR
	[COMMAND] delete vlan.dat] (only if it hasn't been moved from default)
		
		After removing the vlan.dat and restarting the switch it is now
			in factory default condition concerning VLANS

	NOTE: for Catalyst switch the [COMMAND] erase startup-config /// is
		required delete vlan.dat to restore it to factory condition

Verifying VLAN Information
	
	After a VLAN is configured it can be validated using Cisco IOS show
		commands



	show vlan :::

		brief - Display one line for each VLAN with the VLAN name status,
			and its ports

		id [vlan_id] - Display information about a single VLAN identified by
			VLAN ID number, for vlan-id the range is 1 to 4096

		name [vlan-name] - Display information about a single VLAN 
			identified by VLAN name. The VLAN name is an ASCII string from 1
			to 32 characters

		summary - Display VLAN summary information

	show interfaces :::

		[interface-id]- Valid interfaces include physical ports (including
			type, module, and port number) and port channels. The
			port-channel range is 1 to 6.

		vlan [vlan-id] - VLAN identification. The range is 1 to 4096

		switchport - Display the administrative and operationsal status of a
			switching port, including port blocking and port protection
			settings.
	
