Configuring IEEE 802.1Q Trunk Links

	A VLAN trunk is an OSI Layer 2 link between two switches that carries
		for all VLANS (unless the allowed VLAN list is resctricted)

	To enable trunk links, enable the same sets of commands on both sides

	Change the port into permanent trunking mode

		[COMMAND] S1(config-if)# switchport mode trunk

		The port enters Dynamic Trunking Protocol (DTP) negotiation to 
			change the link it trunk even if the other side doesn't want to

		In this course, [COMMAND] switchport mode trunk// is the only way
			to implement a trunk

	To specify a native VLAN other than the default, use:

		[COMMAND]S1(config-if)# switchport trunk native vlan [vlan-list]

	To specify VLANs allowed on the trunk use:
	
		[COMMAND]S1(config-if)# switchport trunk allowed vlan [vlan-list]
			ex of vlan-list : 10,20,30


	If the native VLAN is not allowed on the trunk link, no data from it
		will be allowed on the trunk


	Note: This configuration assumes the use of Cisco Catalyst 2960 
		switches which automatically use 802.1Q encapsulation on trunk 
		links. Other switches may require manual configuration of the 
		encapsulation. Always configure both ends of a trunk link with the 
		same native VLAN. If 802.1Q trunk configuration is not the same on 
		both ends, Cisco IOS Software reports errors. 

Resetting The Trunk to Default State  

	[COMMANDS]

		S1# configure terminal

		S1(config)# interface [interface_id]

		S1(config-if)# no switchport trunk allowed vlan
			set trunk to allow all VLANS	

		S1(config-if)# no switchport trunk native vlan
			Reset native VLAN to default

		S1(config-if)# end


		To check the configurations done use:

			[COMMAND]	

				s1# show interfaces f0/1 switchport

					look for Access Mode VLAN: and Trunking VLANS Enabled:

				S1# show interfaces [interface-id] switchport

					look for Administrative Mode: either static access or 
						trunk

